Revit 2027 API
AssemblyInstance.Disassemble Method
 Removes the assembly instance and releases the member elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> Disassemble()
Public Function Disassemble As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ Disassemble()
member Disassemble : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 ids of elements previously under the assembly instance.
See Also
Reference
AssemblyInstance Class
Autodesk.Revit.DB Namespace